Revit 2026 API

# UVIsAlmostEqualTo(UV) Method

---

Determines whether this 2-D vector and the specified 2-D vector are the same within the tolerance (1.0e-09).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAlmostEqualTo(
	UV source
)
```
```vb
Public Function IsAlmostEqualTo (
	source As UV
) As Boolean
```
```cpp
public:
bool IsAlmostEqualTo(
	UV^ source
)
```
```fsharp
member IsAlmostEqualTo :
        source : UV -> bool
```

#### Parameters

source UV
    The vector to compare with this vector.

#### Return Value

BooleanTrue if the vectors are the same; otherwise, false.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when left is . |

#### Reference

UV Class

IsAlmostEqualTo Overload

Autodesk.Revit.DB Namespace